#!/bin/bash

# Set install mode to online since boot.sh is used for curl installations
export OMANIRI_ONLINE_INSTALL=true

ansi_art='
 ▄██████▄     ▄▄▄▄███▄▄▄▄      ▄████████  ███▄▄▄▄     ▄█     ▄████████   ▄█
███    ███  ▄██▀▀▀███▀▀▀██▄   ███    ███  ███▀▀▀██▄  ███    ███    ███  ███
███    ███  ███   ███   ███   ███    ███  ███   ███  ███▌   ███    ███  ███▌
███    ███  ███   ███   ███   ███    ███  ███   ███  ███▌  ▄███▄▄▄▄██▀  ███▌
███    ███  ███   ███   ███ ▀███████████  ███   ███  ███▌ ▀▀███▀▀▀▀▀    ███▌
███    ███  ███   ███   ███   ███    ███  ███   ███  ███  ▀███████████  ███
███    ███  ███   ███   ███   ███    ███  ███   ███  ███    ███    ███  ███
 ▀██████▀    ▀█   ███   █▀    ███    █▀    ▀█   █▀   █▀     ███    ███  █▀
                                                            ███    ███  '
clear
echo -e "\n$ansi_art\n"

sudo pacman -Syu --noconfirm --needed git

OMANIRI_REPO="${OMANIRI_REPO:-niraletter/omaniri}"

echo -e "\nCloning omaniri from: https://github.com/${OMANIRI_REPO}.git"
rm -rf ~/.local/share/omaniri/
git clone "https://github.com/${OMANIRI_REPO}.git" ~/.local/share/omaniri >/dev/null

echo -e "\nInstallation starting..."
source ~/.local/share/omaniri/install.sh
